import React from "react";
import Container from "@/components/Container";

const OfferContract = () => {
  return (
    <section className="min-h-screen bg-white py-8 md:py-12">
      <Container>
        <div className="">
          <h1 className="text-3xl md:text-4xl font-bold mb-6 font-montserrat">
            Договор-оферта
          </h1>
          <div className="text-base md:text-lg mb-8 leading-relaxed">
            <div className="font-semibold mb-1">Публичная оферта</div>
            <div className="mb-4 text-blue-700">
              <a
                href="https://encar-russia.ru/"
                target="_blank"
                rel="noopener noreferrer"
              >
                https://encar-russia.ru/
              </a>
            </div>
            <div className="mb-4">
              <span className="font-semibold">
                Индивидуальный предприниматель Закиров Динар Гулемович
              </span>
              , зарегистрированный в реестре индивидуальных предпринимателей под
              № 324180000031074 (далее –{" "}
              <span className="font-semibold">«Администрация»</span>), размещает
              настоящую публичную оферту в соответствии со ст. 435 и 437
              Гражданского Кодекса Российской Федерации (далее –{" "}
              <span className="font-semibold">«Оферта»</span>) с предложением
              физическим и (или) юридическим лицам, действующим в лице
              представителя, заключить Договор на нижеследующих условиях:
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              1. Термины
            </h2>
            <div className="mb-2">
              1.1. В целях единого толкования и понимания, нижеприведенные
              термины используются в следующем значении:
            </div>
            <div className="mb-2">
              1.1.1. Акцепт публичной оферты – полное и безоговорочное принятие
              Пользователем условий настоящей публичной Оферты (далее –{" "}
              <span className="font-semibold">«Акцепт»</span>).
            </div>
            <div className="mb-2">
              1.1.2. Договор – возмездное соглашение между Администрацией и
              Пользователем, заключенное посредством Акцепта публичной Оферты
              (далее – <span className="font-semibold">«Договор»</span> или{" "}
              <span className="font-semibold">«Оферта»</span>, в зависимости от
              контекста).
            </div>
            <div className="mb-2">
              1.1.3. Пользователь – физическое лицо, заключившее с
              Администрацией Договор на условиях, содержащихся в настоящей
              публичной Оферте (далее –{" "}
              <span className="font-semibold">«Пользователь»</span>).
            </div>
            <div className="mb-2">
              1.1.4. Сервис – веб-сайт, расположенный в сети интернет по адресу{" "}
              <a
                href="https://encar-russia.ru/"
                target="_blank"
                rel="noopener noreferrer"
                className="text-blue-700"
              >
                https://encar-russia.ru/
              </a>{" "}
              (далее – <span className="font-semibold">«Сервис»</span>).
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              2. Предмет договора и общие положения
            </h2>
            <div className="mb-2">
              2.1. В соответствии с настоящим Договором-Офертой Администрация
              обязуется оказать Пользователю информационные услуги. Во
              исполнение настоящего Договора Администрация обязуется оформить
              подписку на получение обновлений о продаже автомобилей из Кореи,
              получение отчета о техническом состоянии и страховой истории ,
              оказывать иные услуги в соответствии с информацией, представленной
              в Сервисе.
            </div>
            <div className="mb-2">
              2.2. Пользователь получает доступ к Сервису через доступ к
              персональному аккаунту.
            </div>
            <div className="mb-2">
              2.3. Пользователь обязуется обновлять персональные данные,
              предоставленные при регистрации, в случае их изменения;
              обеспечивать сохранность персональных данных от доступа третьих
              лиц; не передавать в пользование свой персональный аккаунт и/или
              логин и пароль своего персонального аккаунта третьим лицам.
            </div>
            <div className="mb-2">
              2.4. Пользователь на собственное усмотрение устанавливает логин и
              пароль персонального аккаунта. Выбирая пароль для персонального
              аккаунта, Пользователь самостоятельно обеспечивает его
              конфиденциальность и несет ответственность за его надежность
              (устойчивость к взлому).
            </div>
            <div className="mb-2">
              2.5. Стороны не вправе ссылаться на незаключенность настоящего
              Договора при встречном предоставлении в порядке статьи 432 ГК РФ.
            </div>
            <div className="mb-2">
              2.6. Новая редакция Договора (Оферты) вступает в силу в день ее
              опубликования.
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              3. Акцепт оферты
            </h2>
            <div className="mb-2">
              3.1. Акцептом Договора-Оферты является факт оплаты Пользователем
              Договора; конклюдентные действия Пользователя или любое
              взаимодействие Пользователя с функционалом Сервиса в любом объеме,
              иное волеизъявление, исходя существа правоотношений Сторон.
            </div>
            <div className="mb-2">
              3.2. До Акцепта настоящей оферты Пользователь обязуется
              ознакомиться с ее содержанием. При наличии каких-либо сомнений в
              толковании условий настоящей Оферты Пользователь вправе до
              совершения Акцепта обратиться к Администрации с письменным
              запросом, в том числе посредством сети интернет, иным способом,
              исходя из существа правоотношений, в ином случае Пользователь не
              имеет права ссылаться на незнание Оферты, если иное не установлено
              императивными нормами законодательства РФ.
            </div>
            <div className="mb-2">
              3.3. Администрация вправе по своему усмотрению создавать, изменять
              или отменять условия настоящей Оферты, если иное не предусмотрено
              императивными нормами законодательства РФ.
            </div>
            <div className="mb-2">
              3.4. Совершая Акцепт, Пользователь подтверждает свою полную
              дееспособность. Акцепт не может считаться совершенным в случае,
              если совершен недееспособным лицом, а также лицом, не достигшим
              возраста 18 лет (исключая случай эмансипации). Риск совершения
              Акцепта недееспособным лицом или лицом, не достигшим
              совершеннолетия, лежит на законных представителях такого лица.
            </div>
            <div className="mb-2">
              3.5. Администрация сообщает, что данная Оферта действует совместно
              с Политикой конфиденциальности, принимая условия настоящей Оферты,
              Пользователь также ознакомился с условиями Политики
              конфиденциальности и безоговорочно принимает их в полном объеме.
            </div>
            <div className="mb-2">
              3.6. В случае если Политика конфиденциальности противоречит
              Оферте, приоритет следует отдавать условиям Договора.
            </div>
            <div className="mb-2">
              3.7. Оплата Договора Пользователем производится посредством
              сервиса приема платежей (платежной системы) в соответствии с
              информацией, представленной на соответствующих страницах
              (разделах) Сервиса Администрации. Пользователь Акцептом настоящей
              Оферты подтверждает также, что ознакомился с офертой, политикой
              конфиденциальности и иными документами сервиса приема платежей
              (платежной системы).
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              4. Финансовые условия
            </h2>
            <div className="mb-2">
              4.1. Цена настоящего Договора составляет от 100 (ста рублей. 00
              коп.) рублей. Сумма зависит от выбранной услуги и срока подписки
            </div>
            <div className="mb-2">
              4.2. Моментом исполнения обязательства Пользователя по уплате
              денежных средств в пользу Администрации считается момент
              поступления денежных средств на расчетный счет Администрации.
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              5. Срок действия договора
            </h2>
            <div className="mb-2">
              5.1. Настоящий Договор вступает в силу с даты его Акцепта и
              действует до полного исполнения собственных обязательств каждой из
              Сторон.
            </div>
            <div className="mb-2">
              5.2. Условие: Расторжение (прекращение действия) настоящего
              Договора не означает прекращения действия иных, связанных с
              Договором документов (в т.ч. приложений и дополнительных
              соглашений), если иное не указано в соответствующих документах.
            </div>
            <div className="mb-2">
              5.3. Каждая из Сторон вправе в одностороннем внесудебном порядке
              отказаться от Договора, уведомив другую Сторону за 10 календарных
              дней до отказа. Договор считается прекращенным по истечении
              указанного срока (включительно).
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              6. Ответственность сторон
            </h2>
            <div className="mb-2">
              6.1. Стороны несут ответственность за последствия собственных
              действий в соответствии с действующим законодательством Российской
              Федерации.
            </div>
            <div className="mb-2">
              6.2. Ответственность Сторон по Договору ограничена ценой
              настоящего Договора, Сторона не вправе предъявить иной Стороне
              требование стоимостью свыше цены Договора (если иное не
              установлено императивными нормами законодательства Российской
              Федерации.
            </div>
            <div className="mb-2">
              6.3. Пользователь заверяет Администрацию о достоверности
              предоставляемой информации.
            </div>
            <div className="mb-2">
              6.4. Пользователь обязуется не использовать программное
              обеспечение (и иной код) для автоматизированного сбора информации
              и (или) взаимодействия с Сервисом, в ином случае Пользователь
              обязан возместить Администрации убытки, причиненные указанными
              действиями, в полном объеме.
            </div>
            <div className="mb-2">
              6.5. Пользователь при взаимодействии с Администрацией обязуется не
              распространять информацию, которая направлена на пропаганду войны,
              разжигание национальной, расовой или религиозной ненависти и
              вражды, а также иной информации, за распространение которой
              предусмотрена уголовная или административная ответственность.
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              7. Заключительные положения
            </h2>
            <div className="mb-2">
              7.1. В случае признания недействительным какого-либо положения
              настоящего Договора, остальные его положения не утрачивают свою
              силу.
            </div>
            <div className="mb-2">
              7.2. Если иное прямо не предусмотрено Договором, ничто в Договоре
              не может пониматься как установление между Сторонами агентских
              отношений, отношений товарищества, отношений по совместной
              деятельности, отношений личного найма, либо каких-то иных
              отношений, прямо не предусмотренных Договором.
            </div>
            <div className="mb-2">
              7.3. Обо всех изменениях своего местонахождения или банковских
              реквизитов, а равно других обстоятельств, имеющих значение для
              надлежащего исполнения настоящего Договора, Стороны обязаны
              извещать друг друга незамедлительно.
            </div>
            <div className="mb-2">
              7.4. В случае изменения каких-либо сведений о Стороне в период
              действия настоящего Договора, такая Сторона обязуется уведомить об
              этом другую Сторону в течение 5 календарных дней, в противном
              случае, все связанные с отсутствием такого уведомления риски
              Сторона несет самостоятельно.
            </div>
            <div className="mb-2">
              7.5. Принимая настоящую Оферту, Стороны подтверждают, что:
            </div>
            <div className="mb-2">
              7.5.1. ознакомились с Договором и им понятны значения используемых
              в Договоре терминов, слов и выражений согласно их
              нормативно-правовому определению или толкованию, указанному в
              Договоре;
            </div>
            <div className="mb-2">
              7.5.2. заключают Договор добровольно и согласны с его условиями;
            </div>
            <div className="mb-2">
              7.5.3. имеют право на самостоятельное совершение сделки (в
              частности, заключение Договора) и действий, предусмотренных
              Договором.
            </div>
            <h2 className="text-xl md:text-2xl font-bold mt-8 mb-3 font-montserrat">
              8. Реквизиты администрации
            </h2>
            <div className="mb-2">ИП Закиров Динар Гулемович</div>
            <div className="mb-2">
              Почтовый адрес: 450077, Уфа, ул. Цюрупы, д. 75, кв. 39
            </div>
            <div className="mb-2">ОГРНИП 324180000031074, ИНН 027817207015</div>
            <div className="mb-2">
              Банк ПАО Сбербанк, БИК 044525225, кор/счет 30101810400000000225
            </div>
            <div className="mb-2">Расчётный счёт 40802 810 8 3800 0478701</div>
          </div>
        </div>
      </Container>
    </section>
  );
};

export default OfferContract;
